In [11]:
import pandas as pd
C=pd.Series([2.1,3.2,4.3],index=["A","B","C"])  # For integer values return int64
print(C)

A    2.1
B    3.2
C    4.3
dtype: float64

In [4]:
import pandas as pd
C=pd.Series(["HI","HELLO","HEY"],index=["A","B","C"])
print(C)

A       HI
B    HELLO
C      HEY
dtype: object

In [5]:
import pandas as pd
C=pd.Series([True,False,True],index=["A","B","C"])
print(C)

A     True
B    False
C     True
dtype: bool

In [12]:
# Changing datatype:
import pandas as pd
C=pd.Series([True,False,True],index=["A","B","C"],dtype=str)
print(type(C[1]))                       # check type of series

<class 'str'>

C:\Users\hp\AppData\Local\Temp\ipykernel_17824\1100837434.py:3: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(type(C[1]))                       # check type of series

In [32]:
data={"NAME":["Uma","Bhavya","Ritika","Sashwat","Asha","Sushma"],"MATH":[56,78,89,None,45,79],"CHEM":[78,90,94,90,67,69]}
df=pd.DataFrame(data)
print(df)

      NAME  MATH  CHEM
0      Uma  56.0    78
1   Bhavya  78.0    90
2   Ritika  89.0    94
3  Sashwat   NaN    90
4     Asha  45.0    67
5   Sushma  79.0    69

In [22]:
r=df.head()
s=df.head(3)
print(r,"\n")
print(s)
display(s)            # display shows data in gradient table form

      NAME  MATH  CHEM
0      Uma    56    78
1   Bhavya    78    90
2   Ritika    89    94
3  Sashwat    78    90
4     Asha    45    67

     NAME  MATH  CHEM
0     Uma    56    78
1  Bhavya    78    90
2  Ritika    89    94

     NAME  MATH  CHEM
0     Uma    56    78
1  Bhavya    78    90
2  Ritika    89    94

In [25]:
u=df.tail()
v=df.tail(2)
print(u,"\n")
print(v)

      NAME  MATH  CHEM
1   Bhavya    78    90
2   Ritika    89    94
3  Sashwat    78    90
4     Asha    45    67
5   Sushma    79    69

     NAME  MATH  CHEM
4    Asha    45    67
5  Sushma    79    69

In [33]:
i=df.info(data)
print(i)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   NAME    6 non-null      object
 1   MATH    5 non-null      float64
 2   CHEM    6 non-null      int64
dtypes: float64(1), int64(1), object(1)
memory usage: 276.0+ bytes
None

In [4]:
import pandas as pd
data2=pd.DataFrame({"Age":[45,34,31],"Salary":[3000,4000,2000]})
print(data2)
print(data2.shape)
print(data2.size)
print(data2.describe())

   Age  Salary
0   45    3000
1   34    4000
2   31    2000
(3, 2)
6
             Age  Salary
count   3.000000     3.0
mean   36.666667  3000.0
std     7.371115  1000.0
min    31.000000  2000.0
25%    32.500000  2500.0
50%    34.000000  3000.0
75%    39.500000  3500.0
max    45.000000  4000.0

In [6]:
print(data2.columns)
print(data2.values)
print(data2.dtypes)

Index(['Age', 'Salary'], dtype='object')
[[  45 3000]
 [  34 4000]
 [  31 2000]]
Age       int64
Salary    int64
dtype: object

In [56]:
data=pd.DataFrame({"NAME":["Uma","Bhavya","Ritika","Sashwat","Asha","Sushma"],"MATH":[56,78,89,None,45,79],"CHEM":[78,90,94,90,67,69]})
print(data.isnull())
print(data.isnull().sum())

    NAME   MATH   CHEM
0  False  False  False
1  False  False  False
2  False  False  False
3  False   True  False
4  False  False  False
5  False  False  False
NAME    0
MATH    1
CHEM    0
dtype: int64

In [74]:
print(data.drop("MATH",axis=1),"\n")    # 1 or 'columns
print(data.drop([0,1],axis=0),"\n")     # 0 or 'index'
print(data.drop(2,axis='index'))        # Remove row of 2nd index

      NAME  CHEM
0      Uma    78
1   Bhavya    90
2   Ritika    94
3  Sashwat    90
4     Asha    67
5   Sushma    69

      NAME  MATH  CHEM
2   Ritika  89.0    94
3  Sashwat   NaN    90
4     Asha  45.0    67
5   Sushma  79.0    69

      NAME  MATH  CHEM
0      Uma  56.0    78
1   Bhavya  78.0    90
3  Sashwat   NaN    90
4     Asha  45.0    67
5   Sushma  79.0    69

In [75]:
print(data.to_csv())

,NAME,MATH,CHEM
0,Uma,56.0,78
1,Bhavya,78.0,90
2,Ritika,89.0,94
3,Sashwat,,90
4,Asha,45.0,67
5,Sushma,79.0,69

In [4]:
import pandas as pd
df=pd.read_csv(r"C:\Users\hp\Desktop\Employees_data.csv")
df

       Name  Age  Salary  Department               Post Gender
0    Nitesh   34   40000     Finance    General Manager      M
1    Tamana   23   50000       Sales          Executive      F
2       Uma   21   30000   Marketing  Assistant manager      F
3    Ritika   29   20000    Security     Deputy Manager      F
4   Shubham   37   70000  Purchasing           Engineer      M
5  Himanshi   27   60000          HR        Supervisior      F
6    Akshat   30   55000          IT     Senior Manager      M
7    Kartik   26   90000     Quality    Senior Engineer      M
8     Rahul   38   82000         PPC             Helper      M

In [10]:
data2=pd.DataFrame({"Age":[45,34,31],"Salary":[3000,4000,2000]})
data2.corr()     # Applicable for only numerical dataframe

             Age    Salary
Age     1.000000  0.203497
Salary  0.203497  1.000000

In [16]:
data2=pd.DataFrame({"Age":[45,45,31],"Salary":[3000,3000,2000]})
data2.drop_duplicates()

   Age  Salary
0   45    3000
2   31    2000

In [9]:
data=pd.DataFrame({"NAME":["Uma","Bhavya","Ritika","Sashwat","Asha","Sushma"],"MATH":[56,78,89,None,45,79],"CHEM":[78,90,94,90,67,69]})
data.fillna(0)   # Replace NaN value by 0.0 in MATH column

      NAME  MATH  CHEM
0      Uma  56.0    78
1   Bhavya  78.0    90
2   Ritika  89.0    94
3  Sashwat   0.0    90
4     Asha  45.0    67
5   Sushma  79.0    69